Revit 2027 API
FilterElementIdRule.UsesLevelFiltering Method
 This function checks if a parameter uses level filtering.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool UsesLevelFiltering(
	Document doc,
	ElementId parameterId
)
Public Shared Function UsesLevelFiltering (
	doc As Document,
	parameterId As ElementId
) As Boolean
public:
static bool UsesLevelFiltering(
	Document^ doc,
	ElementId^ parameterId
)
static member UsesLevelFiltering :
        doc : Document *
        parameterId : ElementId -> bool
Parameters
doc Document
 The document which owns the parameter.
parameterId ElementId
 The id of the parameter that will be tested to see if it uses level filtering.
Return Value
Boolean
 True if the parameter uses level filtering, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 When level-filtering parameters are compared, the comparisons will first compare the values of the levels' elevations, then compare the levels' names, and finally the levels' element ids to rank and sort the levels.
See Also
Reference
FilterElementIdRule Class
Autodesk.Revit.DB Namespace